package programers.codingtest.sort;

public class Solution2 {
	// 주어진 수를 합쳐 큰수 만들기
	// 1. 숫자들을 이어붙여 가장 큰 수를 만든다.
	// 2. 자릿수를 비교한다.
	// 3. 작은 자릿수중 가장 큰수부터 문자열값으로 변경하여 앞으로 이어붙인다.
	// 4. 자릿수 가장 큰것까지 반복한다.
	
//	 문제
//	0 또는 양의 정수가 주어졌을 때, 정수를 이어 붙여 만들 수 있는 가장 큰 수를 알아내 주세요.
//	예를 들어, 주어진 정수가 [6, 10, 2]라면 [6102, 6210, 1062, 1026, 2610, 2106]를 만들 수 있고, 
//	이중 가장 큰 수는 6210입니다.
//	0 또는 양의 정수가 담긴 배열 numbers가 매개변수로 주어질 때, 
//	순서를 재배치하여 만들 수 있는 가장 큰 수를 문자열로 바꾸어 return 하도록 solution 함수를 작성해주세요.
	//
	
}
